/******************************************************************************

**Lab Assignment 39**
เขียนโปรแกรมLeap Year(ปีอธิกสุรทิน)
หลักการคำนวณคือ:

ถ้าหารด้วย 400 ลงตัว = เป็น Leap Year (เช่น 2000, 2400)

ถ้าหารด้วย 4 ลงตัว และ หาร 100 ไม่ลงตัว = เป็น Leap Year (เช่น 2024, 2020)

นอกเหนือจากนั้น = ไม่เป็น Leap Year (เช่น 2100, 2023)

*******************************************************************************/

#include <stdio.h>

int main() {
    int year;

    printf("Enter Year (A.D.): ");
    scanf("%d", &year);

    // เงื่อนไข: (หาร 400 ลงตัว) หรือ (หาร 4 ลงตัว แต่ต้องหาร 100 ไม่ลงตัว)
    if ((year % 400 == 0) || (year % 4 == 0 && year % 100 != 0)) {
        printf("%d is a Leap Year (366 days).\n", year);
    } else {
        printf("%d is NOT a Leap Year (365 days).\n", year);
    }

    return 0;
}