/******************************************************************************
**Lab Assignment 6**
จงเขียนโปรแกรมเพื่อทำการคำนวณผลลัพธ์ของ 3x^3 - 5x^2 +6

*******************************************************************************/

#include <stdio.h>
#include <math.h> // สามารถใช้ pow(x,3) ได้ถ้าต้องการ แต่เขียนคูณกันตรงๆ จะง่ายกว่า

int main() {
    float x, result;

    // รับค่า Input
    printf("***********************************************\n");
    printf("*                                             *\n");
    printf("*           Polynomial Calculator             *\n");
    printf("*                                             *\n");
    printf("***********************************************\n");
    printf("Enter X: ");
    scanf("%f", &x);

    // Process
    //result = (3 * x * x * x) - (5 * x * x) + 6;
    result = 3*pow(x,3)-5*pow(x,2)+6;

    //Output
    printf("Result = %.2f\n", result);

    return 0;
}