/******************************************************************************
**Lab Assignment 9**
เขียนโปรแกรมเพื่อประมวลผลการสอบ โดยกำหนดให้รับค่าคะแนนสอบกลางภาคไม่เกิน
(100 คะแนน) และตรวจสอบว่าผ่านหรือไม่ โดยกำหนดเกณฑ์การผ่านคือ 70 คะแนนขึ้นไป

*******************************************************************************/

#include <stdio.h>

int main() {
    int score;
    
    printf(" _____________________________________________\n");
    printf("|                                             |\n");
    printf("|         Exam Score Calculator               |\n");
    printf("|                                             |\n");
    printf(" _____________________________________________\n");
    printf("Enter score (0-100): ");
    scanf("%d", &score);

    if (score >= 70) {
        printf("Passed\n");
    } else {
        printf("Failed\n");
    }
    return 0;
}