/******************************************************************************

**Lab Assignment 17**
เขียนโปรแกรมเพื่อคำนวณผลรวมของตัวเลขตั้งแต่ 1 ถึง 10 โดยใช้คำสั่ง for

*******************************************************************************/

#include <stdio.h>

int main() {
    int i;
    int sum = 0; // ต้องเริ่มค่าผลรวมที่ 0 เสมอ

    // วนลูป i ตั้งแต่ 1 ถึง 10
    for (i = 1; i <= 10; i++) {
        sum = sum + i; // หรือเขียนว่า sum += i;
    }

    printf("Sum of 1 to 10 is %d\n", sum);

    return 0;
}