/******************************************************************************

**Lab Assignment 18**
เขียนโปรแกรมเพื่อคำนวณผลรวมของตัวเลขตั้งแต่ 1 ถึง N โดยใช้คำสั่ง for

*******************************************************************************/

#include <stdio.h>

int main() {
    int n, i;
    int sum = 0;

    printf("Enter N: ");
    scanf("%d", &n);

    // วนลูป i ตั้งแต่ 1 ถึง n
    for (i = 1; i <= n; i++) {
        sum += i;
    }

    printf("Sum of 1 to %d is %d\n", n, sum);

    return 0;
}