/******************************************************************************

**Lab Assignment 21**
เขียนโปรแกรมคำนวนผลรวม 1 ถึง 10 โดยใช้ while

*******************************************************************************/

#include <stdio.h>

int main() {
    int i = 1;      // กำหนดค่าเริ่มต้น
    int sum = 0;

    while (i <= 10) {   // ตรวจสอบเงื่อนไข
        sum += i;       // บวกค่า
        i++;            // เพิ่มค่าตัวนับ
    }

    printf("Sum 1 to 10 is %d\n", sum);
    return 0;
}